      *----------------------------------------------------------------
      *--- CALLED PROGRAM ---------------------------------------------
      *----------------------------------------------------------------
       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBOL22T.
      *----------------------------------------------------------------
       ENVIRONMENT DIVISION.
      *----------------------------------------------------------------
       DATA DIVISION.
       LINKAGE SECTION.
       77       A            PIC 9(03).
       77       B            PIC 9(03).
       77       C            PIC 9(04).
      *----------------------------------------------------------------
       PROCEDURE DIVISION USING A, B, C.
      *----------------------------------------------------------------
      *--- CALLED PROGRAM LOGIC STARTS HERE ---------------------------
      *----------------------------------------------------------------
       0000-MAIN-PARA.
           DISPLAY "WELCOME TO PROGRAM : COBOL22T".
           COMPUTE C = A + B.
           DISPLAY "THANK YOU FOR USING THE PROGRAM : COBOL22T".
           GOBACK.
      *----------------------------------------------------------------
