      *----------------------------------------------------------------
      *--- CALL COMMAND : CALLING PROGRAM -----------------------------
      *----------------------------------------------------------------
       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBOL21S.
      *----------------------------------------------------------------
       ENVIRONMENT DIVISION.
      *----------------------------------------------------------------
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77     PGM-NAME        PIC X(08)    VALUE SPACES.
      *----------------------------------------------------------------
       PROCEDURE DIVISION.
      *----------------------------------------------------------------
      *--- PROGRAM LOGIC STARTS HERE ----------------------------------
      *----------------------------------------------------------------
       0000-MAIN-PARA.
           DISPLAY "WELCOME TO PROGRAM : COBOL21S".
           DISPLAY " ".

           DISPLAY "HELLO !!!".
           MOVE "COBOL21T" TO PGM-NAME.
           CALL PGM-NAME.
           DISPLAY "I AM FINE !!!".

           DISPLAY " ".
           DISPLAY "THANK YOU FOR USING THE PROGRAM : COBOL21S".
           STOP RUN.
      *----------------------------------------------------------------
      *----------------------------------------------------------------
