      *----------------------------------------------------------------
      *--- 88 LEVEL : CONDITIONAL NAME --------------------------------
      *----------------------------------------------------------------
       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBOL17.
      *----------------------------------------------------------------
       ENVIRONMENT DIVISION.
      *----------------------------------------------------------------
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77     CTR          PIC 9(02)     VALUE 0.
       88     END-OF-LOOP                VALUE 6.
       77     A            PIC 9(02)     VALUE 0.
       77     B            PIC 9(02)     VALUE 0.
      *----------------------------------------------------------------
       PROCEDURE DIVISION.
      *----------------------------------------------------------------
      *--- PROGRAM LOGIC STARTS HERE ----------------------------------
      *----------------------------------------------------------------
       0000-MAIN-PARA.
           DISPLAY "WELCOME".
           MOVE 1 TO CTR.
           PERFORM 1000-SHOW-MESG-1-PARA UNTIL END-OF-LOOP.
           MOVE  1 TO CTR.
           PERFORM 2000-SHOW-MESG-2-PARA UNTIL END-OF-LOOP.
           MOVE  1 TO CTR.
           PERFORM 3000-SHOW-MESG-3-PARA UNTIL END-OF-LOOP.
           DISPLAY "OVER".
           STOP RUN.
      *----------------------------------------------------------------
      *--- SHOW MESSAGE 1 ---------------------------------------------
      *----------------------------------------------------------------
       1000-SHOW-MESG-1-PARA.
           DISPLAY "HELLO : ", CTR.
           ADD 1 TO CTR.
           EXIT.
      *----------------------------------------------------------------
      *--- SHOW MESSAGE 2 ---------------------------------------------
      *----------------------------------------------------------------
       2000-SHOW-MESG-2-PARA.
           DISPLAY "GOOD MORNING : ", CTR.
           ADD 1 TO CTR.
           EXIT.
      *----------------------------------------------------------------
      *--- SHOW MESSAGE 3 ---------------------------------------------
      *----------------------------------------------------------------
       3000-SHOW-MESG-3-PARA.
           DISPLAY "HOW ARE YOU ? ", CTR.
           ADD 1 TO CTR.
           EXIT.
      *----------------------------------------------------------------
