//OZAGS3V    JOB   'FINANCE-123','MADHAV',NOTIFY=OZAGS3,TIME=(2,30)
//* ------------------------------------------------------------------
//* --- DELETE ESDS CLUSTER
//* ------------------------------------------------------------------
//STEP01     EXEC  PGM=IDCAMS
//SYSPRINT   DD    SYSOUT=*
//SYSIN      DD    *
   DELETE OZAGS3.COMPANY.ESDS.CLUSTER
/*
//* ------------------------------------------------------------------
//* --- DEFINE ESDS CLUSTER
//* ------------------------------------------------------------------
//STEP02     EXEC  PGM=IDCAMS
//SYSPRINT   DD    SYSOUT=*
//SYSIN      DD    *
     DEFINE CLUSTER(NAME(OZAGS3.COMPANY.ESDS.CLUSTER) -
                    VOLUMES(USR001) -
                    NONINDEXED -
                    TRACKS(10,7) -
                    RECORDSIZE(80,80) -
                    REUSE -
                   ) -
               DATA(NAME(OZAGS3.COMPANY.ESDS.DATA))
/*
//* ------------------------------------------------------------------
//* --- COPY DATA FROM PS FILE TO ESDS FILE
//* ------------------------------------------------------------------
//STEP03     EXEC  PGM=IDCAMS
//SYSPRINT   DD    SYSOUT=*
//DD01       DD    DSN=OZAGS3.EMP.PS1,DISP=OLD
//DD02       DD    DSN=OZAGS3.COMPANY.ESDS.CLUSTER,DISP=OLD
//SYSIN      DD    *
   REPRO   INFILE(DD01)  OUTFILE(DD02)   REUSE
/*
//* ------------------------------------------------------------------
